In [66]:
import pandas as pd
import numpy as np

In [67]:
AirportData = pd.read_csv('project1.csv')
AirportData.columns =['Airlines','Status',AirportData.columns[2],AirportData.columns[3],AirportData.columns[4],AirportData.columns[5],AirportData.columns[6]]

In [68]:
type(AirportData)

pandas.core.frame.DataFrame

#### Airport Data with raw headers

In [69]:
AirportData

  Airlines   Status  Los Angeles  Phoenix  San Diego  San Francisco  Seattle
0   ALASKA  on time        479.0    221.0      212.0          503.0   1841.0
1      NaN  delayed         62.0     12.0       20.0          102.0    305.0
2      NaN      NaN          NaN      NaN        NaN            NaN      NaN
3  AM WEST  on time        694.0   4840.0      383.0          320.0    201.0
4      NaN  delayed        117.0    415.0       65.0          129.0     61.0

#### Renaming Headers and dropping the NaN row

In [70]:
AirportData = AirportData.dropna(how='all')

#### Replace cells NaN with respective values ALASKA and AM WEST

In [71]:
AirportData.at[1,'Airlines'] = 'ALASKA'
AirportData.at[4,'Airlines'] = 'AM WEST'

In [72]:
AirportData

  Airlines   Status  Los Angeles  Phoenix  San Diego  San Francisco  Seattle
0   ALASKA  on time        479.0    221.0      212.0          503.0   1841.0
1   ALASKA  delayed         62.0     12.0       20.0          102.0    305.0
3  AM WEST  on time        694.0   4840.0      383.0          320.0    201.0
4  AM WEST  delayed        117.0    415.0       65.0          129.0     61.0

In [73]:
AirportData['Airlines'] = AirportData['Airlines'] +' '+ AirportData['Status']

/tmp/ipykernel_9310/3822950228.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  AirportData['Airlines'] = AirportData['Airlines'] +' '+ AirportData['Status']

In [74]:
AirportData

,Airlines,Status,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,ALASKA on time,on time,479.0,221.0,212.0,503.0,1841.0
1,ALASKA delayed,delayed,62.0,12.0,20.0,102.0,305.0
3,AM WEST on time,on time,694.0,4840.0,383.0,320.0,201.0
4,AM WEST delayed,delayed,117.0,415.0,65.0,129.0,61.0

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html?highlight=loc#pandas.DataFrame.loc